# Чтобы собрать приложение в Docker выполните команду - docker build -t ваше-имя-образа .
# Что бы запустит новый контейнер на основе собранного образа выполните команду - docker run ваше-имя-образа
# Используем официальный образ Golang в качестве базового образа
FROM golang:1.16-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем исходный код в контейнер
COPY . .

# Собираем Go-приложение
RUN go build -o main .

# Задаем команду для запуска при старте контейнера
CMD ["./main"]
